In [1]:
# Exercises
# Do your work for this exercise in a python script or a jupyter notebook with the name dataframes.py or dataframes.ipynb.

# For several of the following exercises, you'll need to load several datasets using the pydataset library. (If you get an error when trying to run the import below, use pip to install the pydataset package.)

In [1]:
from pydataset import data
import pandas as pd
import numpy as np

In [3]:
# When the instructions say to load a dataset, you can pass the name of the dataset as a string to the data function to load the dataset. You can also view the documentation for the data set by passing the show_doc keyword argument.

In [9]:
# data('mpg', show_doc=True) # view the documentation for the dataset
# mpg = data('mpg') # load the dataset and store it in a variable
# All the datasets loaded from the pydataset library will be pandas dataframes.

In [10]:
# 1. Copy the code from the lesson to create a dataframe full of student grades.

np.random.seed(123)

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# randomly generate scores for each student for each subject
# note that all the values need to have the same length here
math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades})

type(df)

pandas.core.frame.DataFrame

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   name     12 non-null     object
 1   math     12 non-null     int64
 2   english  12 non-null     int64
 3   reading  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes

In [12]:
df.describe()

            math    english    reading
count  12.000000  12.000000  12.000000
mean   84.833333  77.666667  86.500000
std    11.134168  13.371158   9.643651
min    62.000000  62.000000  67.000000
25%    78.500000  63.750000  80.750000
50%    90.000000  77.500000  89.000000
75%    92.250000  86.750000  93.250000
max    98.000000  99.000000  98.000000

In [16]:
df.dtypes

name       object
math        int64
english     int64
reading     int64
dtype: object

In [17]:
df.shape

(12, 4)

In [18]:
df.columns

Index(['name', 'math', 'english', 'reading'], dtype='object')

In [19]:
df.index

RangeIndex(start=0, stop=12, step=1)

In [21]:
# a. Create a column named passing_english that indicates whether each student has a passing grade in english.

df["passing_english"] = df.english > 70
df

       name  math  english  reading  passing_english
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
9   Richard    69       80       94             True
10    Isaac    92       99       93             True
11     Alan    92       62       72            False

In [24]:
# b. Sort the english grades by the passing_english column. How are duplicates handled?

df.sort_values(by = "passing_english", ascending = False)

       name  math  english  reading  passing_english
0     Sally    62       85       80             True
1      Jane    88       79       67             True
2     Suzie    94       74       95             True
3     Billy    98       96       88             True
4       Ada    77       92       98             True
5      John    79       76       93             True
9   Richard    69       80       94             True
10    Isaac    92       99       93             True
6    Thomas    82       64       81            False
7     Marie    93       63       90            False
8    Albert    92       62       87            False
11     Alan    92       62       72            False

In [27]:
# c. Sort the english grades first by passing_english and then by student name. All the students that are failing english should be first, and within the students that are failing english they should be ordered alphabetically. The same should be true for the students passing english. (Hint: you can pass a list to the .sort_values method)

df.sort_values(by = "name").sort_values(by = "passing_english")

       name  math  english  reading  passing_english
11     Alan    92       62       72            False
8    Albert    92       62       87            False
7     Marie    93       63       90            False
6    Thomas    82       64       81            False
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True
1      Jane    88       79       67             True
5      John    79       76       93             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
2     Suzie    94       74       95             True

In [29]:
# d. Sort the english grades first by passing_english, and then by the actual english grade, similar to how we did in the last step

df.sort_values(by = "passing_english").sort_values(by = "english")

       name  math  english  reading  passing_english
8    Albert    92       62       87            False
11     Alan    92       62       72            False
7     Marie    93       63       90            False
6    Thomas    82       64       81            False
2     Suzie    94       74       95             True
5      John    79       76       93             True
1      Jane    88       79       67             True
9   Richard    69       80       94             True
0     Sally    62       85       80             True
4       Ada    77       92       98             True
3     Billy    98       96       88             True
10    Isaac    92       99       93             True

In [37]:

# e. Calculate each students overall grade and add it as a column on the dataframe. The overall grade is the average of the math, english, and reading grades

overall_grade = (df["math"] + df["english"] + df["reading"]) / 3
df["overall_grade"] = overall_grade
df.sort_values(by = "overall_grade")
df

       name  math  english  reading  passing_english  overall_grade
0     Sally    62       85       80             True      75.666667
1      Jane    88       79       67             True      78.000000
2     Suzie    94       74       95             True      87.666667
3     Billy    98       96       88             True      94.000000
4       Ada    77       92       98             True      89.000000
5      John    79       76       93             True      82.666667
6    Thomas    82       64       81            False      75.666667
7     Marie    93       63       90            False      82.000000
8    Albert    92       62       87            False      80.333333
9   Richard    69       80       94             True      81.000000
10    Isaac    92       99       93             True      94.666667
11     Alan    92       62       72            False      75.333333

In [105]:
# 2. Load the mpg dataset. Read the documentation for the dataset and use it for the following questions:

data('mpg', show_doc = True) # view the documentation for the dataset
mpg = data('mpg') # load the dataset and store it in a variable

# How many rows and columns are there?
# R. 234 rows and 11 columns/variables

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [51]:
# What are the data types of each column?
# R. 1) object, 2) object, 3) float64, 4) int64, 5) int64, 6) object, 7) object, 8) int64, 9) int64, 10) object, 11) object
mpg.dtypes

manufacturer     object
model            object
displ           float64
year              int64
cyl               int64
trans            object
drv              object
cty               int64
hwy               int64
fl               object
class            object
dtype: object

In [52]:
# Summarize the dataframe with .info and .describe
# R. 
mpg.describe

<bound method NDFrame.describe of     manufacturer   model  displ  year  cyl  ... drv cty  hwy  fl    class
1           audi      a4    1.8  1999    4  ...   f  18   29   p  compact
2           audi      a4    1.8  1999    4  ...   f  21   29   p  compact
3           audi      a4    2.0  2008    4  ...   f  20   31   p  compact
4           audi      a4    2.0  2008    4  ...   f  21   30   p  compact
5           audi      a4    2.8  1999    6  ...   f  16   26   p  compact
..           ...     ...    ...   ...  ...  ...  ..  ..  ...  ..      ...
230   volkswagen  passat    2.0  2008    4  ...   f  19   28   p  midsize
231   volkswagen  passat    2.0  2008    4  ...   f  21   29   p  midsize
232   volkswagen  passat    2.8  1999    6  ...   f  16   26   p  midsize
233   volkswagen  passat    2.8  1999    6  ...   f  18   26   p  midsize
234   volkswagen  passat    3.6  2008    6  ...   f  17   26   p  midsize

[234 rows x 11 columns]>

In [54]:
# Rename the cty column to city.
mpg.rename(columns = {'cty': 'city'})

    manufacturer   model  displ  year  cyl  ... drv city  hwy  fl    class
1           audi      a4    1.8  1999    4  ...   f   18   29   p  compact
2           audi      a4    1.8  1999    4  ...   f   21   29   p  compact
3           audi      a4    2.0  2008    4  ...   f   20   31   p  compact
4           audi      a4    2.0  2008    4  ...   f   21   30   p  compact
5           audi      a4    2.8  1999    6  ...   f   16   26   p  compact
..           ...     ...    ...   ...  ...  ...  ..  ...  ...  ..      ...
230   volkswagen  passat    2.0  2008    4  ...   f   19   28   p  midsize
231   volkswagen  passat    2.0  2008    4  ...   f   21   29   p  midsize
232   volkswagen  passat    2.8  1999    6  ...   f   16   26   p  midsize
233   volkswagen  passat    2.8  1999    6  ...   f   18   26   p  midsize
234   volkswagen  passat    3.6  2008    6  ...   f   17   26   p  midsize

[234 rows x 11 columns]

In [56]:
# Rename the hwy column to highway.
mpg.rename(columns = {"hwy" : "highway"})

    manufacturer   model  displ  year  cyl  ... drv cty  highway  fl    class
1           audi      a4    1.8  1999    4  ...   f  18       29   p  compact
2           audi      a4    1.8  1999    4  ...   f  21       29   p  compact
3           audi      a4    2.0  2008    4  ...   f  20       31   p  compact
4           audi      a4    2.0  2008    4  ...   f  21       30   p  compact
5           audi      a4    2.8  1999    6  ...   f  16       26   p  compact
..           ...     ...    ...   ...  ...  ...  ..  ..      ...  ..      ...
230   volkswagen  passat    2.0  2008    4  ...   f  19       28   p  midsize
231   volkswagen  passat    2.0  2008    4  ...   f  21       29   p  midsize
232   volkswagen  passat    2.8  1999    6  ...   f  16       26   p  midsize
233   volkswagen  passat    2.8  1999    6  ...   f  18       26   p  midsize
234   volkswagen  passat    3.6  2008    6  ...   f  17       26   p  midsize

[234 rows x 11 columns]

In [57]:
mpg

    manufacturer   model  displ  year  cyl  ... drv cty  hwy  fl    class
1           audi      a4    1.8  1999    4  ...   f  18   29   p  compact
2           audi      a4    1.8  1999    4  ...   f  21   29   p  compact
3           audi      a4    2.0  2008    4  ...   f  20   31   p  compact
4           audi      a4    2.0  2008    4  ...   f  21   30   p  compact
5           audi      a4    2.8  1999    6  ...   f  16   26   p  compact
..           ...     ...    ...   ...  ...  ...  ..  ..  ...  ..      ...
230   volkswagen  passat    2.0  2008    4  ...   f  19   28   p  midsize
231   volkswagen  passat    2.0  2008    4  ...   f  21   29   p  midsize
232   volkswagen  passat    2.8  1999    6  ...   f  16   26   p  midsize
233   volkswagen  passat    2.8  1999    6  ...   f  18   26   p  midsize
234   volkswagen  passat    3.6  2008    6  ...   f  17   26   p  midsize

[234 rows x 11 columns]

In [71]:
# Do any cars have better city mileage than highway mileage?
# R. 

city_better_than_hwy = np.where(mpg["cty"] > mpg["hwy"], True, False)
mpg["city mileage is superior"] = city_better_than_hwy
mpg.where(mpg["city mileage is superior"] == True)

    manufacturer model  displ  year  ...  hwy   fl class  city mileage is superior
1            NaN   NaN    NaN   NaN  ...  NaN  NaN   NaN                       NaN
2            NaN   NaN    NaN   NaN  ...  NaN  NaN   NaN                       NaN
3            NaN   NaN    NaN   NaN  ...  NaN  NaN   NaN                       NaN
4            NaN   NaN    NaN   NaN  ...  NaN  NaN   NaN                       NaN
5            NaN   NaN    NaN   NaN  ...  NaN  NaN   NaN                       NaN
..           ...   ...    ...   ...  ...  ...  ...   ...                       ...
230          NaN   NaN    NaN   NaN  ...  NaN  NaN   NaN                       NaN
231          NaN   NaN    NaN   NaN  ...  NaN  NaN   NaN                       NaN
232          NaN   NaN    NaN   NaN  ...  NaN  NaN   NaN                       NaN
233          NaN   NaN    NaN   NaN  ...  NaN  NaN   NaN                       NaN
234          NaN   NaN    NaN   NaN  ...  NaN  NaN   NaN                       NaN

[234 rows x 12 columns]

In [76]:
(mpg["cty"] > mpg["hwy"]).all()

False

In [78]:
# Create a column named mileage_difference this column should contain the difference between highway and city mileage for each car.

mpg["mileage_difference"] = (mpg["hwy"] - mpg["cty"])
mpg

    manufacturer   model  ...  city mileage is superior  mileage_difference
1           audi      a4  ...                     False                  11
2           audi      a4  ...                     False                   8
3           audi      a4  ...                     False                  11
4           audi      a4  ...                     False                   9
5           audi      a4  ...                     False                  10
..           ...     ...  ...                       ...                 ...
230   volkswagen  passat  ...                     False                   9
231   volkswagen  passat  ...                     False                   8
232   volkswagen  passat  ...                     False                  10
233   volkswagen  passat  ...                     False                   8
234   volkswagen  passat  ...                     False                   9

[234 rows x 13 columns]

In [96]:
# Which car (or cars) has the highest mileage difference?

mpg.sort_values(by = "mileage_difference", ascending = False).head(5)

    manufacturer       model  ...  city mileage is superior  mileage_difference
107        honda       civic  ...                     False                  12
223   volkswagen  new beetle  ...                     False                  12
1           audi          a4  ...                     False                  11
229   volkswagen      passat  ...                     False                  11
36     chevrolet      malibu  ...                     False                  11

[5 rows x 13 columns]

In [111]:
# Which compact class car has the lowest highway mileage? The best?

mpg[mpg["class"] == "compact"].sort_values(by = "hwy").head(1)

    manufacturer  model  displ  year  cyl     trans drv  cty  hwy fl    class
220   volkswagen  jetta    2.8  1999    6  auto(l4)   f   16   23  r  compact

In [113]:
# Which compact class car has the lowest highway mileage? The best?

mpg[mpg["class"] == "compact"].sort_values(by = "hwy", ascending = False).head(1)

    manufacturer  model  displ  year  cyl       trans drv  cty  hwy fl    class
213   volkswagen  jetta    1.9  1999    4  manual(m5)   f   33   44  d  compact

In [115]:
# Create a column named average_mileage that is the mean of the city and highway mileage.

mpg["average"] = (mpg["hwy"] + mpg["cty"]) / 2
mpg.sort_values(by = "average", ascending = False)

    manufacturer                model  displ  year  ...  hwy fl       class  average
222   volkswagen           new beetle    1.9  1999  ...   44  d  subcompact     39.5
213   volkswagen                jetta    1.9  1999  ...   44  d     compact     38.5
223   volkswagen           new beetle    1.9  1999  ...   41  d  subcompact     35.0
197       toyota              corolla    1.8  2008  ...   37  r     compact     32.5
196       toyota              corolla    1.8  1999  ...   35  r     compact     30.5
..           ...                  ...    ...   ...  ...  ... ..         ...      ...
127         jeep   grand cherokee 4wd    4.7  2008  ...   12  e         suv     10.5
60         dodge          durango 4wd    4.7  2008  ...   12  e         suv     10.5
66         dodge  ram 1500 pickup 4wd    4.7  2008  ...   12  e      pickup     10.5
70         dodge  ram 1500 pickup 4wd    4.7  2008  ...   12  e      pickup     10.5
55         dodge    dakota pickup 4wd    4.7  2008  ...   12  e      pickup     10.5

[234 rows x 12 columns]

In [117]:
# Which dodge car has the best average mileage? The worst?

mpg[mpg["manufacturer"] == "dodge"].sort_values(by = "average", ascending = False).head(1)

   manufacturer        model  displ  year  cyl  ... cty hwy  fl    class average
38        dodge  caravan 2wd    2.4  1999    4  ...  18  24   r  minivan    21.0

[1 rows x 12 columns]

In [2]:
# Load the Mammals dataset. Read the documentation for it, and use the data to answer these questions:

data("Mammals", show_doc = True)
mammals = data("Mammals")

# How many rows and columns are there?
# R. 107 row, and 4 columns/variables

Mammals

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Garland(1983) Data on Running Speed of Mammals

### Description

Observations on the maximal running speed of mammal species and their body
mass.

### Usage

    data(Mammals)

### Format

A data frame with 107 observations on the following 4 variables.

weight

Body mass in Kg for "typical adult sizes"

speed

Maximal running speed (fastest sprint velocity on record)

hoppers

logical variable indicating animals that ambulate by hopping, e.g. kangaroos

specials

logical variable indicating special animals with "lifestyles in which speed
does not figure as an important factor": Hippopotamus, raccoon (Procyon),
badger (Meles), coati (Nasua), skunk (Mephitis), man (Homo), porcupine
(Erithizon), oppossum (didelphis), and sloth (Bradypus)

### Details

Used by Chappell (1989) and Koenker, Ng and Portnoy (1994) to illustrate the
fitting of piecewise linear curves.

### Source

Garland, T. (1983) The relation between maximal running speed and body mass in
terrestrial mammals, _J. Zoology_, 199, 1557-1570.

### References

Koenker, R., P. Ng and S. Portnoy, (1994) Quantile Smoothing Splines”
_Biometrika_, 81, 673-680.

Chappell, R. (1989) Fitting Bent Lines to Data, with Applications ot
Allometry, _J. Theo. Biology_, 138, 235-256.

### See Also

`rqss`

### Examples

    data(Mammals)
    attach(Mammals)
    x <- log(weight)
    y <- log(speed)
    plot(x,y, xlab="Weight in log(Kg)", ylab="Speed in log(Km/hour)",type="n")
    points(x[hoppers],y[hoppers],pch = "h", col="red")
    points(x[specials],y[specials],pch = "s", col="blue")
    others <- (!hoppers & !specials)
    points(x[others],y[others], col="black",cex = .75)
    fit <- rqss(y ~ qss(x, lambda = 1),tau = .9)
    plot(fit)

In [121]:
# What are the data types?

mammals.dtypes

weight      float64
speed       float64
hoppers        bool
specials       bool
dtype: object

In [122]:
# Summarize the dataframe with .info and .describe

mammals.info

<bound method DataFrame.info of        weight  speed  hoppers  specials
1    6000.000   35.0    False     False
2    4000.000   26.0    False     False
3    3000.000   25.0    False     False
4    1400.000   45.0    False     False
5     400.000   70.0    False     False
6     350.000   70.0    False     False
7     300.000   64.0    False     False
8     260.000   70.0    False     False
9     250.000   40.0    False     False
10   3800.000   25.0    False      True
11   1000.000   60.0    False     False
12    900.000   70.0    False     False
13    900.000   56.0    False     False
14    800.000   29.0    False     False
15    750.000   57.0    False     False
16    500.000   32.0    False     False
17    450.000   56.0    False     False
18    300.000   72.0    False     False
19    300.000   90.0    False     False
20    250.000   80.0    False     False
21    250.000   56.0    False     False
22    170.000   80.0    False     False
23    150.000   48.0    False     False
24    130.000   70.0    False     False
25    120.000   80.0    False     False
26    120.000   61.0    False     False
27    110.000   33.0    False     False
28    100.000   64.0    False     False
29     85.000   55.0    False     False
30     80.000   65.0    False     False
31     72.000   56.0    False     False
32     70.000   45.0    False     False
33     65.000   60.0    False     False
34     62.000   81.0    False     False
35     50.000  100.0    False     False
36     50.000   60.0    False     False
37     50.000   40.0    False     False
38     50.000   47.0    False     False
39     37.000  105.0    False     False
40     35.000   80.0    False     False
41     34.000   97.0    False     False
42     30.000   97.0    False     False
43     30.000   80.0    False     False
44     30.000   45.0    False     False
45     20.000   81.0    False     False
46    400.000   40.0    False     False
47    300.000   48.0    False     False
48    230.000   56.0    False     False
49    150.000   59.0    False     False
50    135.000   48.0    False     False
51     65.000   65.0    False     False
52     60.000   60.0    False     False
53     55.000  110.0    False     False
54     45.000   50.0    False     False
55     40.000   64.0    False     False
56     25.000   67.0    False     False
57     20.000   70.0    False     False
58     16.000   65.0    False     False
59     12.000   24.0    False      True
60     11.000   30.0    False      True
61     10.000   56.0    False     False
62      7.000   60.0    False     False
63      6.000   72.0    False     False
64      5.000   64.0    False     False
65      5.000   27.0    False      True
66      3.000   16.0    False      True
67    127.000   32.0    False     False
68     70.000   40.0    False      True
69     13.000   37.0    False      True
70      9.000    3.2    False      True
71      4.000   16.0    False     False
72      0.600   36.0    False     False
73      0.600   20.0    False     False
74      0.550   27.0    False     False
75      0.500   18.0    False     False
76      0.400   20.0    False     False
77      0.300   13.0    False     False
78      0.250    9.7    False     False
79      0.220   15.0    False     False
80      0.110    9.0    False     False
81      0.100   17.0    False     False
82      0.056   21.0     True     False
83      0.050   11.0    False     False
84      0.045   16.0    False     False
85      0.035   32.0     True     False
86      0.035   14.0     True     False
87      0.030    6.8    False     False
88      0.030    9.1    False     False
89      0.025   11.0    False     False
90      0.025    8.6    False     False
91      0.018    8.9    False     False
92      0.016   13.0    False     False
93      0.100    4.0    False     False
94      0.100    2.4    False     False
95      0.016    3.6    False     False
96      4.600   64.0     True     False
97      4.400   72.0     True     False
98      4.000   72.0     True     False
99      3.500   56.0     True     False
100     2.000   64.0     True     False
101     1.900   56.0     True     False
102     1.500   50.0     True     False
103     1.500   40.0     True     False
104    50.000   65.0    False     False
105     5.000    7.4    False      True
106     0.024   13.0    False     False
107     4.000    1.6    False      True>

In [124]:
# What is the the weight of the fastest animal?
# R. 55.0

mammals.sort_values(by = "speed", ascending = False).head(1)

    weight  speed  hoppers  specials
53    55.0  110.0    False     False

In [11]:
# What is the overal percentage of specials?

rows_w_specials = len(mammals[mammals["specials"] == True])
overall_percentage = rows_w_specials / len([mammals["specials"]])
overall_percentage

10.0

In [11]:
# How many animals are hoppers that are above the median speed? What percentage is this?

In [4]:
# Finding all the Mammals that fall in the category of "hoppers" and sorting them in terms of declining "speed" values

all_hoppers = mammals[mammals["hoppers"] == True].sort_values(by = "speed", ascending = False)
all_hoppers

     weight  speed  hoppers  specials
97    4.400   72.0     True     False
98    4.000   72.0     True     False
96    4.600   64.0     True     False
100   2.000   64.0     True     False
99    3.500   56.0     True     False
101   1.900   56.0     True     False
102   1.500   50.0     True     False
103   1.500   40.0     True     False
85    0.035   32.0     True     False
82    0.056   21.0     True     False
86    0.035   14.0     True     False

In [5]:
# Finding the "speed" median for all Mammals included in the Dataframe

the_median = mammals["speed"].median()
the_median

48.0

In [6]:
# Finding all the Mammals that fall in the "hoppers" category and that register a "speed" greater than the total median for all Mammals in the Dataframe

fast_hoppers = mammals.loc[(mammals["speed"] > the_median) & (mammals["hoppers"] == True)].sort_values(by = "speed", ascending = False)
fast_hoppers

     weight  speed  hoppers  specials
97      4.4   72.0     True     False
98      4.0   72.0     True     False
96      4.6   64.0     True     False
100     2.0   64.0     True     False
99      3.5   56.0     True     False
101     1.9   56.0     True     False
102     1.5   50.0     True     False

In [7]:
# Determining the percentage of "hoppers" that beat the median "speed" of all Mammals in Dataframe, in relation to all Mammals that fall in the "hoppers" category

percentage_of_fast_hoppers = (len(fast_hoppers) / len(all_hoppers)) * 100
percentage_of_fast_hoppers

63.63636363636363

In [8]:
# Determining the percentage of "hoppers" that beat the median "speed" of all Mammals in Dataframe, in relation to all Mammals in Dataframe

fastest_hoppers_in_mammals_kingdom = (len(fast_hoppers) / len(mammals)) * 100
fastest_hoppers_in_mammals_kingdom

6.5420560747663545